{
  "workbench.productIconTheme": "fluent-icons",
  // Tema de iconos. Valor por defecto: "vs-seti". 
  // Descripci贸n: Define el tema de iconos utilizado en la interfaz de usuario.
  "symbols.hidesExplorerArrows": false,
  // Oculta las flechas del explorador. Valor por defecto: false. 
  // Descripci贸n: Indica si se deben ocultar las flechas de navegaci贸n en el explorador de Ficheros.
  // 'Cascadia Code NF', 'FiraCode Nerd Font Mono SemBd', 'UbuntuMono Nerd Font Mono', 'Droid Sans Mono', 'monospace'
  "editor.fontFamily": "'Cascadia Code NF', 'CaskaydiaCove Nerd Font Mono', 'Cascadia Mono NF','GeistMono Nerd Font Mono' , 'ZedMono Nerd Font Mono', 'VictorMono Nerd Font Mono', 'UbuntuSansMono Nerd Font Mono', 'UbuntuMono Nerd Font Mono','Ubuntu Nerd Font','Tinos Nerd Font', 'Terminess Nerd Font Mono','Symbols Nerd Font Mono', 'SpaceMono Nerd Font Mono','Source Code Pro Nerd Font Mono','ShureTechMono Nerd Font Mono','RobotoMono Nerd Font Mono','RecMonoSmCasual Nerd Font Mono','ProggyClean Nerd Font Mono','ProFont IIx Nerd Font Mono','OverpassM Nerd Font Mono','OpenDyslexicM Nerd Font Mono','NotoSansM Nerd Font Mono','M+CodeLat60 Nerd Font Mono','Mononoki Nerd Font Mono','Monoid Nerd Font Mono','Monofur Nerd Font Mono','Monaspace Argon', 'Monaspace Radon', 'Monaspace Neon', 'Monaspace Xenon', 'Monaspace Krypton', 'Monaspace Boron', 'MesloLGL Nerd Font Mono','MartianMono Nerd Font Mono','Lilex Nerd Font Mono','Liberation Mono','Lekton Nerd Font Mono','JetBrainsMono Nerd Font Mono','IosevkaTermSlab Nerd Font Mono','IosevkaTerm Nerd Font Mono','Iosevka Nerd Font Mono','IntoneMono Nerd Font Mono','Inconsolata LGC Nerd Font Mono','InconsolataGo Nerd Font Mono','Inconsolata Nerd Font Mono','iMWritingMono Nerd Font','Hurmit Nerd Font Mono', 'Hasklug Nerd Font Mono', 'Hack Nerd Font Mono','GohuFont 14 Nerd Font Mono','Go Mono for Powerline' ,'GeistMono Nerd Font Mono','FiraCode Nerd Font Mono SemBd', 'FantasqueSansM Nerd Font Mono','EnvyCodeR Nerd Font Mono', 'DroidSansM Nerd Font Mono','DejaVu Sans Mono','DaddyTimeMono Nerd Font', 'D2CodingLigature Nerd Font Mono', 'Cousine Nerd Font Mono', 'BitstromWera Nerd Font Mono', 'ComicShannsMono Nerd Font','Agave Nerd Font Mono', '0xProto Nerd Font Mono', 'BigBlueTerm437 Nerd Font Mono', 'AurulentSansM Nerd Font Mono', 'Anonymous Pro for Powerline', 'IBM 3270 Semi\\-Condensed', 'Arimo Nerd Font', 'HeavyData Nerd Font Propo', '3270 Nerd Font Mono'",
  // Familia de fuentes del editor de c贸digo. Valor por defecto: "Menlo, Monaco, 'Courier New', monospace". 
  // Descripci贸n: Establece la familia de fuentes utilizada en el editor de c贸digo.
  "editor.fontLigatures": true,
  // Ligaduras tipogr谩ficas del editor de c贸digo. Valor por defecto: false. 
  // Descripci贸n: Habilita o deshabilita las ligaduras tipogr谩ficas en el editor de c贸digo.
  "editor.fontSize": 18,
  // Tama帽o de fuente del editor de c贸digo. Valor por defecto: 14. 
  // Descripci贸n: Establece el tama帽o de fuente utilizado en el editor de c贸digo.
  "editor.lineHeight": 38,
  // Altura de l铆nea del editor de c贸digo. Valor por defecto: 20. 
  // Descripci贸n: Establece la altura de l铆nea utilizada en el editor de c贸digo.
  "editor.guides.indentation": true,
  // Muestra gu铆as de indentaci贸n. Valor por defecto: true. 
  // Descripci贸n: Indica si se deben mostrar las gu铆as de indentaci贸n en el editor de c贸digo.
  "editor.scrollbar.horizontal": "auto",
  // Visibilidad de la barra de desplazamiento horizontal. Valor por defecto: "auto". 
  // Descripci贸n: Controla la visibilidad de la barra de desplazamiento horizontal en el editor de c贸digo.
  "editor.mouseWheelZoom": true,
  // Habilita el zoom con la rueda del rat贸n en el editor de c贸digo. Valor por defecto: false. 
  // Descripci贸n: Permite habilitar o deshabilitar el zoom utilizando la rueda del rat贸n en el editor de c贸digo.
  "editor.wordWrap": "on",
  // Ajuste de l铆nea autom谩tico en el editor de c贸digo. Valor por defecto: "off". 
  // Descripci贸n: Controla si el editor de c贸digo debe ajustar autom谩ticamente las l铆neas largas al ancho del editor.
  "editor.cursorBlinking": "expand",
  // Tipo de parpadeo del cursor en el editor de c贸digo. Valor por defecto: "blink". 
  // Descripci贸n: Configura el tipo de parpadeo del cursor en el editor de c贸digo.
  "terminal.integrated.cursorBlinking": true,
  // Parpadeo del cursor en el terminal integrado. Valor por defecto: true. 
  // Descripci贸n: Controla si el cursor en el terminal integrado debe parpadear.
  "advancedNewFile.exclude": {},
  // Exclusi贸n de Ficheros o carpetas al crear nuevos Ficheros. Valor por defecto: {}. 
  // Descripci贸n: Configura qu茅 Ficheros o carpetas se deben excluir al crear nuevos Ficheros utilizando la extensi贸n Advanced New File.
  "workbench.startupEditor": "newUntitledFile",
  // Tipo de editor que se abre al iniciar el entorno de trabajo. Valor por defecto: "welcomePageInEmptyWorkbench". 
  // Descripci贸n: Establece el tipo de editor que se abrir谩 al iniciar el entorno de trabajo.
  "files.defaultLanguage": "python",
  // Lenguaje predeterminado para los nuevos Ficheros. Valor por defecto: "". 
  // Descripci贸n: Establece el lenguaje predeterminado que se utilizar谩 para los nuevos Ficheros creados.
  "editor.linkedEditing": true,
  // Edici贸n vinculada en el editor de c贸digo. Valor por defecto: false. 
  // Descripci贸n: Habilita la edici贸n vinculada, que permite editar simult谩neamente ocurrencias de la misma variable o s铆mbolo.
  "html.format.wrapAttributes": "force",
  // Formateo de HTML para envolver los atributos forzadamente. Valor por defecto: "auto". 
  // Descripci贸n: Configura c贸mo se deben envolver los atributos al formatear c贸digo HTML.
  "css.styleSheets": [
    "https://unpkg.com/tailwindcss@2.2.19/dist/tailwind.min.css"
  ],
  // Hojas de estilo CSS adicionales a utilizar. Valor por defecto: []. 
  // Descripci贸n: Define las hojas de estilo CSS adicionales que se utilizar谩n en el entorno.
  "editor.codeActionsOnSave": {
    "source.fixAll": "explicit",
    "source.organizeImports": "explicit"
  },
  // Acciones que se deben realizar al guardar un Fichero. Valor por defecto: {}. 
  // Descripci贸n: Configura las acciones autom谩ticas que se deben realizar al guardar un Fichero.
  "markdown-preview-github-styles.lightTheme": "dark",
  // Tema claro para el estilo de vista previa de Markdown. Valor por defecto: "github-light". 
  // Descripci贸n: Configura el tema claro que se utilizar谩 en la vista previa de Markdown.
  "markdown-preview-github-styles.colorTheme": "dark",
  // Tema de color para el estilo de vista previa de Markdown. Valor por defecto: "github-dark". 
  // Descripci贸n: Configura el tema de color que se utilizar谩 en la vista previa de Markdown.
  "markdown-preview-enhanced.previewTheme": "github-dark.css",
  // Tema de vista previa para Markdown. Valor por defecto: "github.css". 
  // Descripci贸n: Configura el tema que se utilizar谩 en la vista previa de Markdown.
  "[jsonc]": {
    "editor.defaultFormatter": "vscode.json-language-features"
  },
  // Formateador predeterminado para Ficheros JSON. Valor por defecto: "". 
  // Descripci贸n: Configura el formateador predeterminado que se utilizar谩 para Ficheros con extensi贸n .json.
  "files.exclude": {
    "**/.git": false,
    "**/.svn": false,
    "**/.hg": false,
    "**/CVS": false,
    "**/.DS_Store": false,
    "**/node_modules": false
  },
  // Exclusi贸n de Ficheros o carpetas del explorador de Ficheros. Valor por defecto: {}. 
  // Descripci贸n: Configura qu茅 Ficheros o carpetas se deben excluir de la vista del explorador de Ficheros.
  "[html]": {
    "editor.defaultFormatter": "vscode.html-language-features"
  },
  "[css]": {
    "editor.defaultFormatter": "vscode.css-language-features"
  },
  "[javascript]": {
    // "editor.defaultFormatter": "dbaeumer.vscode-eslint"
    // "editor.defaultFormatter": "dbaeumer.vscode-eslint"
  },
  "[markdown]": {
    "editor.defaultFormatter": "DavidAnson.vscode-markdownlint"
  },
  "[php]": {
    // "editor.defaultFormatter": "bmewburn.vscode-intelephense-client"
  },
  "markdown-preview-enhanced.revealjsTheme": "moon.css",
  // Tema para la vista previa de Reveal.js en Markdown. Valor por defecto: "reveal.js/dist/reveal.css". 
  // Descripci贸n: Configura el tema que se utilizar谩 en la vista previa de Reveal.js en Markdown.
  "markdown-preview-enhanced.codeBlockTheme": "github-dark.css",
  // Tema para los bloques de c贸digo en la vista previa de Markdown. Valor por defecto: "default". 
  // Descripci贸n: Configura el tema que se utilizar谩 para resaltar bloques de c贸digo en la vista previa de Markdown.
  "editor.guides.bracketPairs": true,
  // Muestra pares de corchetes. Valor por defecto: false. 
  // Descripci贸n: Indica si se deben mostrar pares de corchetes en el editor de c贸digo.
  "editor.language.colorizedBracketPairs": [],
  "editor.bracketPairColorization.enabled": true,
  "editor.autoClosingBrackets": "languageDefined",
  // Tema de color de la interfaz de usuario. Valor por defecto: "Default Dark+". 
  // Descripci贸n: Establece el tema de color utilizado en la interfaz de usuario.
  "oneDarkPro.bold": true,
  // Texto en negrita en el tema One Dark Pro. Valor por defecto: false. 
  // Descripci贸n: Habilita o deshabilita el texto en negrita en el tema One Dark Pro.
  "oneDarkPro.italic": true,
  // Texto en cursiva en el tema One Dark Pro. Valor por defecto: false. 
  // Descripci贸n: Habilita o deshabilita el texto en cursiva en el tema One Dark Pro.
  "oneDarkPro.vivid": true,
  // Colores vibrantes en el tema One Dark Pro. Valor por defecto: false. 
  // Descripci贸n: Habilita o deshabilita colores vibrantes en el tema One Dark Pro.
  "oneDarkPro.markdownStyle": true,
  // Estilo Markdown en el tema One Dark Pro. Valor por defecto: false. 
  // Descripci贸n: Habilita o deshabilita estilos espec铆ficos de Markdown en el tema One Dark Pro.
  "workbench.editor.languageDetection": true,
  // Detecci贸n autom谩tica del lenguaje del Fichero en el editor. Valor por defecto: true. 
  // Descripci贸n: Controla si se debe detectar autom谩ticamente el lenguaje del Fichero abierto en el editor.
  "telemetry.telemetryLevel": "off",
  // Nivel de telemetr铆a. Valor por defecto: "on". 
  // Descripci贸n: Controla la cantidad de datos de telemetr铆a que se env铆an a los servidores de Microsoft.
  // Configuraci贸n de la interfaz de usuario principal
  "diffEditor.renderIndicators": false,
  // Esta configuraci贸n desactiva los indicadores en el editor de diferencias.
  "editor.minimap.enabled": true,
  // Esta configuraci贸n desactiva o activa el minimapa en el editor de c贸digo. La minimapa muestra una vista de desplazamiento de todo el Fichero.
  "editor.minimap.side": "left",
  // Esta configuraci贸n configura la posici贸n del minimapa en el lado izquierdo del editor de c贸digo.
  "workbench.statusBar.visible": true,
  // Esta configuraci贸n oculta o desoculta la barra de estado en la parte inferior de la interfaz de usuario.
  "window.customTitleBarVisibility": "never",
  // Esta configuraci贸n configura la visibilidad de la barra de t铆tulo personalizada. 
  // En este caso, se establece en "never", lo que significa que nunca se mostrar谩 la barra de t铆tulo personalizada.
  "workbench.sideBar.location": "right",
  // Esta configuraci贸n configura la ubicaci贸n de la barra lateral en el lado derecho de la interfaz de usuario.
  "breadcrumbs.enabled": false,
  // Esta configuraci贸n desactiva las migas de pan en la interfaz de usuario. Las migas de pan muestran la ruta del Fichero actual.
  "editor.cursorSmoothCaretAnimation": "on",
  // Esta configuraci贸n activa la animaci贸n suave del cursor en el editor de c贸digo.
  "explorer.openEditors.visible": 10,
  // Esta configuraci贸n define el n煤mero m谩ximo de editores abiertos visibles en el explorador como 10.
  // Configuraci贸n de las pesta帽as
  "workbench.editor.showIcons": true,
  // Esta configuraci贸n activa la visualizaci贸n de iconos en las pesta帽as de los Ficheros en la interfaz de usuario.
  "workbench.editor.tabActionCloseVisibility": true,
  // Esta configuraci贸n desactiva o activa la visibilidad del bot贸n de cierre en las pesta帽as de los Ficheros en la interfaz de usuario.
  "workbench.editor.showTabs": "multiple",
  // Esta configuraci贸n configura la visualizaci贸n de las pesta帽as de Ficheros como ninguna, multiple, single.
  // Configuraci贸n del margen
  "editor.lineNumbers": "on",
  // Esta configuraci贸n desactiva o activa la visualizaci贸n de n煤meros de l铆nea en el editor de c贸digo.
  "editor.glyphMargin": true,
  // Esta configuraci贸n desactiva el margen de glifos en el editor de c贸digo. Los glifos son los peque帽os marcadores que aparecen en el margen.
  "editor.folding": true,
  // Esta configuraci贸n desactiva el plegado de c贸digo en el editor de c贸digo.
  "window.menuBarVisibility": "classic",
  // Esta configuraci贸n oculta la barra de men煤 en la parte superior de la interfaz de usuario.
  "workbench.activityBar.location": "default",
  // Esta configuraci贸n oculta la barra de actividad en la interfaz de usuario.
  "workbench.editor.editorActionsLocation": "hidden",
  // Esta configuraci贸n oculta las acciones del editor en la interfaz de usuario.
  "editor.scrollbar.vertical": "hidden",
  // Esta configuraci贸n oculta o desoculta la barra de desplazamiento vertical en el editor de c贸digo.
  // valor default: auto
  "editor.overviewRulerBorder": false,
  // Esta configuraci贸n desactiva el borde de la regla de vista general en el editor de c贸digo.
  "editor.hideCursorInOverviewRuler": true,
  // Esta configuraci贸n establece el tama帽o de fuente del terminal integrado en 17.
  "terminal.integrated.mouseWheelZoom": true,
  // Esta configuraci贸n habilita el zoom mediante la rueda del rat贸n en el terminal integrado.
  "terminal.integrated.lineHeight": 1.5,
  // Esta configuraci贸n establece la altura de l铆nea del terminal integrado en 1.5.
  "files.autoSave": "afterDelay",
  // Esta configuraci贸n configura el guardado autom谩tico de Ficheros despu茅s de un retraso.
  "editor.defaultFormatter": "aaron-bond.better-comments",
  // Esta configuraci贸n establece el formateador predeterminado del editor de c贸digo como "aaron-bond.better-comments".
  "editor.bracketPairColorization.independentColorPoolPerBracketType": true,
  // Esta configuraci贸n habilita el uso de un conjunto independiente de colores para cada tipo de par茅ntesis en el editor de c贸digo.
  "editor.formatOnSave": true,
  // Esta configuraci贸n activa el formateo autom谩tico al guardar el Fichero en el editor de c贸digo.
  "editor.guides.highlightActiveIndentation": true,
  // Esta configuraci贸n desactiva el resaltado de la indentaci贸n activa en el editor de c贸digo.
  "editor.renderControlCharacters": false,
  "editor.guides.bracketPairsHorizontal": true,
  "[c]": {
    // "editor.defaultFormatter": "ms-vscode.cpptools"
  },
  "[lua]": {
    // "editor.defaultFormatter": "sumneko.lua"
  },
  "editor.multiCursorModifier": "ctrlCmd",
  "editor.multiCursorLimit": 10000,
  "editor.multiCursorPaste": "spread",
  "[csharp]": {
    // "editor.defaultFormatter": "ms-dotnettools.csharp"
  },
  "terminal.integrated.enableMultiLinePasteWarning": "auto",
  "[java]": {
    // "editor.defaultFormatter": "redhat.java"
  },
  "security.workspace.trust.untrustedFiles": "open",
  "terminal.integrated.cursorStyle": "line",
  "terminal.integrated.cursorStyleInactive": "line",
  "terminal.integrated.cursorWidth": 2,
  "[json]": {
    "editor.defaultFormatter": "vscode.json-language-features"
  },
  "[dockerfile]": {
    "editor.defaultFormatter": "ms-azuretools.vscode-docker"
    // "editor.defaultFormatter": "ms-azuretools.vscode-docker"
  },
  // Activa el formato autom谩tico de archivos con ESLint.
  "eslint.format.enable": true,
  // Configura las etiquetas personalizadas en los editores de c贸digo
  // para que muestren el nombre del archivo y la extensi贸n con un icono musical.
  "workbench.editor.customLabels.patterns": {
    "**/src/**": "${filename}.${extname} ",
    "**/lib/**": "${filename}.${extname} ",
    "**/config/**": "${filename}.${extname} "
  },
  // Establece el tema de iconos del espacio de trabajo en "symbols".
  "workbench.iconTheme": "symbols",
  // Habilita las variaciones de fuente en el editor.
  "editor.fontVariations": true, // default: false
  // Configura el peso de fuente del editor a "negrita".
  "editor.fontWeight": "bold", // default: normal
  // Configura el peso de fuente del terminal integrado a "negrita".
  "terminal.integrated.fontWeight": "bold", // default: normal
  // Configura el peso de fuente en negrita para el terminal integrado.
  "terminal.integrated.fontWeightBold": "bold",
  // Activa el estilo de fuente en cursiva para los mensajes de error.
  "errorLens.fontStyleItalic": true, // default: false
  // Configura el peso de fuente para los mensajes de error a "negrita".
  "errorLens.fontWeight": "bold",
  // Establece el tama帽o de fuente del terminal integrado en 20 p铆xeles.
  "terminal.integrated.fontSize": 20,
  "[cpp]": {
    // Comentado: Establece el formateador predeterminado para archivos C++.
    // "editor.defaultFormatter": "ms-vscode.cpptools"
  },
  // Configuraci贸n para el depurador de Python (debugpy) para no filtrar solo el c贸digo del usuario.
  "debugpy.debugJustMyCode": false,
  // Establece la ruta del int茅rprete de Python predeterminado.
  "python.defaultInterpreterPath": "/bin/python3.12",
  // Configura el tema de color del espacio de trabajo a "Bluloco Dark Italic".
  "workbench.colorTheme": "Bluloco Dark Italic",
  // Establece la opacidad del efecto de cristal en Linux al 90%.
  "glassit-linux.opacity": 90
  // Enlaces para iconos musicales:
  // https://www.alt-codes.net/music_note_alt_codes.php
  // https://www.toolcalculator.com/music-symbols.html
}